using System;

namespace fullRandomEHWPF.materials
{
    public static class Detectives
    {
        public static String[][] DetectivArray = new String[9][];

        public static void InitializingTheDetectivArray()
        {
            DetectivArray[0] = new String[12]
            {
                "Aкачи Оньеле","Чарли Кейн","Диана Стэнли","Жаклин Файн", "Джим Кальвер", "Лео Андерсон","Лили Чен","Лола Хейз","Марк Хэрриган","Норман Уизерс","Сайлас Марш","Триш Скарборо"
            };
            DetectivArray[1] = new String[] { };

            DetectivArray[2] = new String[8]
            {
                "Джордж Барнаби","Уилсон Ричардс","Финн Эдвардс","Томми Малдун","Урсула Даунс","Патрис Хэтэуэй","Агнесс Бейкер","Дейзи Уокер"
            };
            DetectivArray[3] = new String[4]
            {
                "Тони Морган","Мари Ламбо","Зои Самарис","Скат О'Тул"
            };
            DetectivArray[4] = new String[8]
            {
                "Сестра Мэри", "Джо Даймонд","Рекс Мерфи","Харви Уолтерс","Хэнк Сэмсон","Минь Тхи Фан","Монтерей Джек","Мэнди Томпсон"
            };
            DetectivArray[5] = new String[4]
            {
                "Майкл МакГлен","Декстер Дрейк","Венди Адамс","Дженни Барнс"
            };
            DetectivArray[6] = new String[8]
            {
                "Дарелл Симмонс","Винсент Ли","Аманда Шарп","Глория Гольдберг","Уильям Йорик","Кейт Уинтроп","Кэролин Ферн","Люк Робинсон"
            };
            DetectivArray[7] = new String[4]
            {
                "Боб Дженкинс","Рита Янг","Роланд Бэнкс","Пит Мусорщик"
            };
            DetectivArray[8] = new String[7]
            {
                "Агата Крейн","Даниэла Рейес","Карсон Синклер","Кельвин Райт","Отец Матео","Престон Фэйрмонт","Сефина Руссо"
            };

        }
    }
}


//"Aкачи Оньеле","Чарли Кейн","Диана Стэнли","Жаклин Файн", "Джим Кальвер", "Лео Андерсон","Лили Чен","Лола Хейз","Марк Хэрриган","Норман Уизерс","Сайлас Марш","Триш Скарборо",
////хребты безумия
//"Джордж Барнаби","Уилсон Ричардс","Финн Эдвардс","Томми Малдун","Урсула Даунс","Патрис Хэтэуэй","Агнесс Бейкер","Дейзи Уокер",
////Таинственные руины
//"Тони Морган","Мари Ламбо","Зои Самарис","Скат О'Тул",
//// под пирамидами
//"Сестра Мэри", "Джо Даймонд","Рекс Мерфи","Харви Уолтерс","Хэнк Сэмсон","Минь Тхи Фан","Монтерей Джек","Мэнди Томпсон",
////знамение каркозы
//"Майкл МакГлен","Декстер Дрейк","Венди Адамс","Дженни Барнс",
////мир грёз
//"Дарелл Симмонс","Винсент Ли","Аманда Шарп","Глория Гольдберг","Уильям Йорик","Кейт Уинтроп","Кэролин Ферн","Люк Робинсон",
////Разрушенные города
//"Боб Дженкинс","Рита Янг","Роланд Бэнкс","Пит Мусорщик",
////маски
//"Агата Крейн","Даниэла Рейес","Карсон Синклер","Кельвин Райт","Отец Матео","Престон Фэйрмонт","Сефина Руссо"